#pragma once

#include <stack>
#include <map>

#include "mmu.h"
#include "controllers/icu.h"
#include "controllers/pic.h"
#include "controllers/uart.h"
#include "address.h"
#include "disassembler.h"
#include "segmentation.h"
#include "forward.h"
#include "register.h"
#include "spdlog/fmt/bundled/chrono.h"


namespace CPUE {

// TODO: when implementing protected instructions, see chapter 2.8: System Instruction Summary
// TODO: when implementing some instructions, look at type checking (chapter 6.4 or page 3250)


class CPU {
public:
    friend MMU;
    friend Disassembler;
    friend TLB;
    friend ICU;
    friend UEFI;
    explicit CPU(size_t available_pages = 2) : m_icu(this), m_mmu(this, available_pages), m_pic(PIC{this}), m_disassembler(Disassembler{this}), m_uart1(UARTController{this}) {
        reset();
    }
    CPU(CPU const&) = delete;

public:
    enum ExecutionMode {
        REAL_MODE,
        LEGACY_MODE,
        PROTECTED_MODE,
        COMPATIBILITY_MODE,
        LONG_MODE,
    };

    enum State {
        STATE_FETCH_INSTRUCTION,
        STATE_HANDLE_INSTRUCTION,
        STATE_HANDLE_INTERRUPT,
        STATE_HALTED,
    };

    enum PrivilegeMode {
        USER_MODE,
        SUPERVISOR_MODE,
    };

    enum PagingMode { PAGING_MODE_NONE, PAGING_MODE_32BIT, PAGING_MODE_PAE, PAGING_MODE_4LEVEL, PAGING_MODE_5LEVEL };

    struct RFLAGS {
        u64 CF : 1; // Carry Flag
        u64 : 1; // Reserved
        u64 PF : 1; // Parity Flag
        u64 : 1; // Reserved
        u64 AF : 1; // Auxiliary Carry Flag
        u64 : 1; // Reserved
        u64 ZF : 1; // Zero Flag
        u64 SF : 1; // Sign Flag
        u64 TF : 1; // Trap Flag
        u64 IF : 1; // Interrupt Enable Flag
        u64 DF : 1; // Direction Flag
        u64 OF : 1; // Overflow Flag
        u64 IOPL : 2; // I/O Privilege Leve
        u64 NT : 1; // Nested Task
        u64 : 1; // Reserved
        u64 RF : 1; // Resume Flag
        u64 VM : 1; // Virtual-8086 Mode
        // Controls alignment-checking in user-mode
        // Allows to disable SMAP for explicit accesses, can only be modified in supervisor mode
        u64 AC : 1; // Alignment Check / Access Control
        u64 VIF : 1; // Virtual Interrupt Flag
        u64 VIP : 1; // Virtual Interrupt Pending
        u64 ID : 1; // ID Flag
    };
    static_assert(sizeof(RFLAGS) == 8);

    // Control Registers
    union CR0 {
        struct Concrete {
            u64 PE : 1; // Protected Mode Enable
            u64 MP : 1; // Monitor Co-Processor
            u64 EM : 1; // Emulation
            u64 TS : 1; // Task Switched
            u64 ET : 1; // Extension Type
            u64 NE : 1; // Numeric Error
            u64 : 10; // Reserved
            u64 WP : 1; // Write Protect
            u64 : 1; // Reserved
            u64 AM : 1; // Alignment Mask
            u64 : 10; // Reserved
            u64 NW : 1; // Not-Write Through
            u64 CD : 1; // Cache Disable
            u64 PG : 1; // Paging
        } c;
        u64 value;
    };
    static_assert(sizeof(CR0) == 8);

    union CR3 {
        struct Concrete {
            u64 _pcid1 : 3;
            u64 PWT : 1;
            u64 PCD : 1;
            u64 _pcid2 : 7;
            u64 pml4_base_paddr : MAXPHYADDR - 12; // Physical Base Address of the PML4
            u64 __reserved1 : 60 - MAXPHYADDR = 0; // Reserved (must be 0)
            u64 LAM_U57 : 1; // When set, enables LAM57 (masking of linear-address bits 62:57) for user pointers and overrides CR3.LAM_U48.
            u64 LAM_U48 : 1; // When set and CR3.LAM_U57 is clear, enables LAM48 (masking of linear-address bits 62:48) for user pointers.
            u64 __reserved2 : 1 = 0; // Reserved (must be 0)
        } c;
        u64 value;

        u64 reserved_bits_ored() const { return c.__reserved1 || c.__reserved2; }

        // // We have to do it this way cause of bit-field limitations/alignment issues
        PCID pcid() const { return ((u16)c._pcid2 << 5) || c.PCD << 4 || c.PWT << 3 || c._pcid1; }
        void set_pcid(PCID pcid) {
            c._pcid1 = bits(pcid, 2, 0);
            c.PWT = bits(pcid, 3, 3);
            c.PCD = bits(pcid, 4, 4);
            c._pcid2 = bits(pcid, 11, 5);
        }
    };
    static_assert(sizeof(CR3) == 8);

    union CR4 {
        struct Concrete {
            u64 VME : 1; // Virtual-8086 Mode Extensions
            u64 PVI : 1; // Protected Mode Virtual Interrupts
            u64 TSD : 1; // Time Stamp enabled only in ring 0
            u64 DE : 1; // Debugging Extensions
            u64 PSE : 1; // Page Size Extension
            u64 PAE : 1; // Physical Address Extension
            u64 MCE : 1; // Machine Check Exception
            u64 PGE : 1; // Page Global Enable
            u64 PCE : 1; // Performance Monitoring Counter Enable
            u64 OSFXSR : 1; // OS support for fxsave and fxrstor instructions
            u64 OSXMMEXCPT : 1; // OS Support for unmasked simd floating point exceptions
            u64 UMIP : 1; // User-Mode Instruction Prevention (SGDT, SIDT, SLDT, SMSW, and STR are disabled in user mode)
            u64 LA57 : 1 = 0; // 57-bit linear addresses. When set in IA-32e mode, the processor uses 5-level paging to translate 57-bit linear addresses. When clear in IA-32e mode, the processor uses 4-level paging to translate 48-bit linear addresses.
            u64 VMXE : 1; // Virtual Machine Extensions Enable
            u64 SMXE : 1; // Safer Mode Extensions Enable
            u64 __reserved1 : 1 = 0; // Reserved (must be 0)
            u64 FSGSBASE : 1; // Enables the instructions RDFSBASE, RDGSBASE, WRFSBASE, and WRGSBASE
            u64 PCIDE : 1; // PCID Enable
            u64 OSXSAVE : 1; // XSAVE And Processor Extended States Enable
            u64 KL : 1 = 0; // Key-Locker-Enable Bit.
            u64 SMEP : 1; // Supervisor Mode Executions Protection Enable
            u64 SMAP : 1; // Supervisor Mode Access Protection Enable
            u64 PKE : 1; // Enable protection keys for user-mode pages
            u64 CET : 1; // Enable Control-flow Enforcement Technology
            u64 PKS : 1; // Enable protection keys for supervisor-mode pages
            u64 UINTR : 1; // Enables user interrupts when set, including user-interrupt delivery, user-interrupt notification identification, and the user-interrupt instructions.
            u64 __reserved2 : 2 = 0; // Reserved (must be 0)
            u64 LAM_SUP : 1; // When set, enables LAM (linear-address masking) for supervisor pointers.
        } c;
        u64 value;

        u64 reserved_bits_ored() const { return c.__reserved1 || c.__reserved2; }
    };
    static_assert(sizeof(CR4) == 8);

    union CR8 {
        struct Concrete {
            u64 TPR : 4; // This sets the threshold value corresponding to the highestpriority interrupt to be blocked. A value of 0 means all interrupts are enabled. This field is available in 64-bit mode. A value of 15 means all interrupts will be disabled.
        } c;
        u64 value;
    };
    static_assert(sizeof(CR8) == 8);

    // Model Specific Registers
    union EFER {
        struct Concrete {
            u64 SCE : 1; // System Call Extensions
            u64 : 7; // Reserved
            u64 LME : 2; // Long Mode Enable
            u64 : 1; // Long Mode Active (See efer_LMA)
            u64 NXE : 1; // No-Execute Enable
            u64 SVME : 1; // Secure Virtual Machine Enable
            u64 LMSLE : 1; // Long Mode Segment Limit Enable
            u64 FFXSR : 1; // Fast FXSAVE/FXRSTOR
            u64 TCE : 1; // Translation Cache Extension u8 16 - 63 0 Reserved
        } c;
        u64 value;
    };


public:
    [[nodiscard]] PagingMode paging_mode() const;
    [[nodiscard]] bool is_paging_enabled() const {
        // We only support 4-Level paging or No paging.
        switch (paging_mode()) {
            case PAGING_MODE_NONE: return false;
            case PAGING_MODE_4LEVEL: return true;
            case PAGING_MODE_32BIT:
            case PAGING_MODE_PAE:
